In [47]:
import pandas as pd
import numpy as np

In [48]:
ser=[4,5,6,7,8]
a=pd.Series(ser)
a

0    4
1    5
2    6
3    7
4    8
dtype: int64

In [49]:
type(a)

pandas.core.series.Series

In [50]:
ser=pd.Series(np.random.randint(1,20,10))
ser

0    15
1    15
2     1
3     2
4     9
5    12
6     5
7     5
8    10
9    18
dtype: int32

In [51]:
ser.head()

0    15
1    15
2     1
3     2
4     9
dtype: int32

In [52]:
ser.index

RangeIndex(start=0, stop=10, step=1)

In [54]:
b= pd.Series(ser,dtype='object')
b

0    15
1    15
2     1
3     2
4     9
5    12
6     5
7     5
8    10
9    18
dtype: object

In [22]:
x={'nsti':['ald','knp','kanpur'],'num':[12,23,22]}
c= pd.DataFrame(x,index=['a','b','c'])
c

     nsti  num
a     ald   12
b     knp   23
c  kanpur   22

In [24]:
z= pd.DataFrame(x,columns=['num'])
z

   num
0   12
1   23
2   22

In [29]:
c.shape

(3, 2)

In [30]:
c.to_csv('h.csv')

In [31]:
c.to_csv('code.csv',index=False)

In [32]:
pd.read_csv('h.csv')

  Unnamed: 0    nsti  num
0          a     ald   12
1          b     knp   23
2          c  kanpur   22

In [35]:
c.to_excel('h.xlsx')

In [36]:
c.duplicated()

a    False
b    False
c    False
dtype: bool

In [38]:
b=c.dropna()
b

     nsti  num
a     ald   12
b     knp   23
c  kanpur   22

In [39]:
import mysql.connector as myconn

In [41]:
mydb=myconn.connect(
host='localhost',
user='root',
password='',
db='day'

)

In [61]:
df= 'SELECT * FROM night '
df1= pd.read_sql(df,mydb)
df1

C:\Users\This pc\AppData\Local\Temp\ipykernel_7852\265708811.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1= pd.read_sql(df,mydb)

       name  age     city course
0      atul   25    delhi    css
1    sakshi   35   kanpur    css
2   saksham   25  kolkata    css
3    gufran   14   punjab    css
4      atul   25    delhi    css
5    sakshi   35   kanpur    css
6   saksham   25  kolkata    css
7    gufran   14   punjab    css
8      atul   25    delhi    css
9    sakshi   35   kanpur    css
10  saksham   25  kolkata    css
11   gufran   14   punjab    css
12     atul   25    delhi    css
13   sakshi   35   kanpur    css
14  saksham   25  kolkata    css
15   gufran   14   punjab    css
16     atul   25    delhi    css
17   sakshi   35   kanpur    css
18  saksham   25  kolkata    css
19   gufran   14   punjab    css

In [62]:
df= 'SELECT * FROM night where age between 20 and 25 '
df1= pd.read_sql(df,mydb)
df1

C:\Users\This pc\AppData\Local\Temp\ipykernel_7852\976929860.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1= pd.read_sql(df,mydb)

      name  age     city course
0     atul   25    delhi    css
1  saksham   25  kolkata    css
2     atul   25    delhi    css
3  saksham   25  kolkata    css
4     atul   25    delhi    css
5  saksham   25  kolkata    css
6     atul   25    delhi    css
7  saksham   25  kolkata    css
8     atul   25    delhi    css
9  saksham   25  kolkata    css

In [ ]:
df= 'SELECT * FROM night  '
df1= pd.read_sql(df,mydb)
df1